In [239]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [240]:
# df = pd.read_csv('https://raw.githubusercontent.com/aamitabhml/py/master/ML/9_decision_tree/Exercise/titanic.csv')
df = pd.read_csv('titanictrain.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [241]:
df2 = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked', 'Survived'], axis= 'columns')
df2.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [242]:
df2.isna().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [243]:
# #Feature 6: Age
# for data in df2:
#     age_avg  = df2['Age'].mean()
#     age_std  = df2['Age'].std()
#     age_null = df2['Age'].isnull().sum()
#     random_list = np.random.randint(age_avg - age_std, age_avg + age_std , size = age_null)
#     df2['Age'][np.isnan(df2['Age'])] = random_list
#     df2['Age'] = df2['Age'].astype(int)
df2.Age = df2.Age.fillna(df2.Age.mean())
df2.Fare = df2.Fare.fillna(df2.Fare.median())
df2.Sex = df2.Sex.map({'male': 1, 'female': 2})

In [244]:
from sklearn.preprocessing import LabelEncoder
sex_n = LabelEncoder()

In [245]:
# df2['Sex_n'] = sex_n.fit_transform(df2['Sex'])
# df2.head()

In [246]:
# X = df2.drop(['Sex'], axis='columns')
X = df2
y = df['Survived']
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [247]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [248]:
model.fit(X, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [249]:
model.score(X, y)

0.9797979797979798

In [250]:
model.predict([[3,22,7.2500,1]])

array([0], dtype=int64)

In [251]:
test = pd.read_csv('titanictest.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [252]:
df3 = test.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis= 'columns')
df3.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [253]:
#Feature 6: Age
# for data in df3:
#     age_avg  = df3['Age'].mean()
#     age_std  = df3['Age'].std()
#     age_null = df3['Age'].isnull().sum()
#     random_list = np.random.randint(age_avg - age_std, age_avg + age_std , size = age_null)
#     df3['Age'][np.isnan(df3['Age'])] = random_list
#     df3['Age'] = df3['Age'].astype(int)
df3.Age = df3.Age.fillna(df3.Age.mean())

In [254]:
# sex_n2 = LabelEncoder()
# df3['Sex_n'] = sex_n2.fit_transform(df3['Sex'])
# df3 = df3.drop(['Sex'], axis= 'columns')
# dd = df3.head()
# dd
# df3.head()
df3.Sex = df3.Sex.map({'male': 1, 'female': 2})

In [255]:
#Feature 5: Fare
# for data in df3:
#     df3['Fare'] = df3['Fare'].fillna(df3['Fare'].median())
df3.Fare = df3.Fare.fillna(df3.Fare.median())

In [256]:
df3.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [257]:
y_pred = model.predict(df3)
y_pred.shape

(418,)

In [258]:
#Create a CSV with results
submission = pd.DataFrame({
    "PassengerId": test["PassengerId"],
    "Survived": y_pred
})
submission.to_csv('submission2.csv', index = False)